output/pages/recipes/recipes.org
** Copycat KFC
*** Ingredients
- 1 whole chicken (2 breasts, 2 thighs, 2 drumsticks, 2 wings)
- 2 quarts neutral oil, for frying
- 1 egg white
- 1 1/2 cups all-purpose flour
- 1 tablespoon brown sugar
- 1 tablespoon kosher salt
- 1 tablespoon paprika
- 2 teaspoons onion salt
- 1 teaspoon chili powder
- 1 teaspoon black pepper
- 1/2 teaspoon celery salt
- 1/2 teaspoon dried sage
- 1/2 teaspoon garlic powder
- 1/2 teaspoon ground allspice
- 1/2 teaspoon dried oregano
- 1/2 teaspoon dried basil
- 1/2 teaspoon dried marjoram
*** Method
1. Preheat fryer to 150°C. Thoroughly mix together all the spice mix
   ingredients.
2. Combine spice mix with flour, brown sugar and salt.
3. Dip chicken pieces in egg white to lightly coat them, then transfer
   to flour mixture. Turn a few times and make sure the flour mix is
   really stuck to the chicken. Repeat with all the chicken pieces.
4. Let chicken pieces rest for 5 minutes so crust has a chance to dry a
   bit.
5. Fry chicken in batches. Breasts and wings should take 15 minutes, and
   legs and thighs will need 20 minutes. Chicken pieces are done when a
   meat thermometer inserted into the thickest part reads 165°F.
6. Let chicken drain on a few paper towels when it comes out of the
   fryer. Serve hot.
*** Notes
**** 2018-03-08
- Tried doubling all spices (not flour)
- 2 egg whites
- *Didn't work*
**** <2018-04-29 Sun>
- cooked for 15 minutes for breast and 20 minutes for legs and thighs on
  150 degrees
** Salsa
*** Ingredients
- 6 ripe tomatoes
- 1 red pepper
- 1 big bunch of fresh coriander
- 1 onion
- 2 fresh jalapeño or green chillies
- 1 large clove of garlic
- 1 lime
- extra virgin olive oil
- 1tsp salt
*** Method
- Finely chop the tomatoes and coriander (stalks and all) and place into
  a large bowl.
- Peel and finely chop the onion, deseed and finely chop the chillies,
  then scrape into the bowl. Peel and finely grate in the garlic.
- Squeeze in the juice from 1 lime, add 2 tablespoons of extra virgin
  olive oil, and mix well. Season to taste with sea salt, black pepper
  and more lime juice, if needed.
- Serve straightaway or cover and set aside for a few hours to let all
  those flavours develop.
** Tacos
*** Ingredients
- 500g beef mince
- 1 onion, chopped
- 1 green pepper, chopped
- 1 garlic clove, crushed
- 2 teaspoon hot paprika
- 2 teaspoon ground cumin
- 1/2 teaspoon dried red chilli flakes
- 1/2 teasponn of cayenne pepper
- 6 tablespoons tomato puree
- 12 flour tortillas or taco shells
- peanut oil, for frying
- 1 tsp salt
- 1 tsp course ground peppper
*** Method
- Dry-fry the mince in a frying pan until brown and crumbly, stirring
  occasionally and breaking it up with a wooden spoon.
- Add the onion, green pepper and garlic; cook, stirring occasionally,
  until softened. Stir in the herbs and spices; season to taste with
  salt and pepper. Add the tomato puree and mix well. Cover and cook
  gently for 10 minutes, stirring occasionally.
- Place a little of the mixture on each tortilla and roll up, or spoon
  into the taco shells. Secure tortillas with a cocktail stick. If using
  tortillas, heat the oil in a frying pan and then fry the rolls quickly
  until golden. Serve with your choice of accompaniments.
** Fajitas
** Hot wings
*** Ingredients
- 3/4 cup all-purpose flour
- 1/2 teaspoon cayenne pepper
- 1/2 teaspoon garlic powder
- 1/2 teaspoon salt
- 20 chicken wings
- 1/2 cup melted butter (100g)
- 1/2 cup hot pepper sauce (such as Frank's RedHot®)
