output/pages/recipes/recipes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-08 Tue 14:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marc Scott" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1581a8f">1. Copycat KFC</a>
<ul>
<li><a href="#org31d7e18">1.1. Ingredients</a></li>
<li><a href="#org3b0fc6e">1.2. Method</a></li>
<li><a href="#orgefbc359">1.3. Notes</a>
<ul>
<li><a href="#orgdb8adb1">1.3.1. 2018-03-08</a></li>
<li><a href="#orgc63e5b1">1.3.2. <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-04-29 Sun&gt;</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga8d9b69">2. Salsa</a>
<ul>
<li><a href="#org8122da0">2.1. Ingredients</a></li>
<li><a href="#org563c9fd">2.2. Method</a></li>
</ul>
</li>
<li><a href="#orge20520b">3. Tacos</a>
<ul>
<li><a href="#orgb4a3c3b">3.1. Ingredients</a></li>
<li><a href="#org118c7ee">3.2. Method</a></li>
</ul>
</li>
<li><a href="#orgb166b3a">4. Fajitas</a></li>
<li><a href="#org332dbe9">5. Hot wings</a>
<ul>
<li><a href="#org19a7f9f">5.1. Ingredients</a></li>
<li><a href="#orgcb7ed32">5.2. Method</a></li>
</ul>
</li>
<li><a href="#org8171228">6. Beef Pad Thai</a>
<ul>
<li><a href="#orgcd08b33">6.1. Ingredients</a></li>
<li><a href="#orgb8d4be2">6.2. Instructions</a>
<ul>
<li><a href="#org058aaad">6.2.1. Thai Peanut Sauce Preparation:</a></li>
<li><a href="#orgf9a02ea">6.2.2. Beef Pad Thai Preparation:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1556fd2">7. Silverside Roast Beef</a>
<ul>
<li><a href="#orgef0d47c">7.1. Ingredints</a></li>
<li><a href="#orgffbf132">7.2. Method</a></li>
<li><a href="#org0c90598">7.3. Notes</a></li>
</ul>
</li>
<li><a href="#org2e68cb6">8. Crispy Pork Belly</a>
<ul>
<li><a href="#org72d6ae6">8.1. Ingredients</a></li>
<li><a href="#orgfec5525">8.2. Method</a></li>
</ul>
</li>
<li><a href="#org6244bdd">9. Yorkshire Puddings</a>
<ul>
<li><a href="#org6559889">9.1. Ingredients</a></li>
<li><a href="#org12e5334">9.2. Method</a></li>
</ul>
</li>
<li><a href="#org6352913">10. Roast Poatoes</a>
<ul>
<li><a href="#org2e7b195">10.1. Ingredients</a></li>
<li><a href="#orge798e17">10.2. Method</a></li>
<li><a href="#orga2cd9ed">10.3. Notes</a></li>
</ul>
</li>
<li><a href="#org3e968e6">11. Gravy</a>
<ul>
<li><a href="#orgeb7fa1a">11.1. Ingredients</a></li>
<li><a href="#org806d0e5">11.2. Method</a></li>
</ul>
</li>
<li><a href="#org8df061a">12. Sauteed Kale</a>
<ul>
<li><a href="#org635ac59">12.1. Ingredients</a></li>
<li><a href="#org2a28b22">12.2. Method</a></li>
</ul>
</li>
<li><a href="#orgb93476a">13. French Fries</a>
<ul>
<li><a href="#org1ae05eb">13.1. Ingredients</a></li>
<li><a href="#org2170ab7">13.2. Method</a></li>
</ul>
</li>
<li><a href="#org09c9e44">14. Burgers</a>
<ul>
<li><a href="#orge234e56">14.1. Ingredients</a>
<ul>
<li><a href="#org175aba5">14.1.1. Stirins</a></li>
</ul>
</li>
<li><a href="#orgbb71394">14.2. Method</a></li>
</ul>
</li>
<li><a href="#org5fdd92d">15. Peri Peri Chicken</a>
<ul>
<li><a href="#orge5ce02f">15.1. Ingredients</a>
<ul>
<li><a href="#org9520fd2">15.1.1. Peri Peri Marinade:</a></li>
</ul>
</li>
<li><a href="#org6c9d7e5">15.2. Method</a></li>
</ul>
</li>
<li><a href="#org834f549">16. Garlic Rice</a>
<ul>
<li><a href="#org8dd0085">16.1. Ingredients</a></li>
<li><a href="#org737e37b">16.2. Method</a></li>
</ul>
</li>
<li><a href="#orgd64b4d6">17. BBQ Brisket</a>
<ul>
<li><a href="#org0f9ce45">17.1. Ingredients</a>
<ul>
<li><a href="#orgde69785">17.1.1. Rub:</a></li>
<li><a href="#org55f58b1">17.1.2. BBQ Sauce:</a></li>
</ul>
</li>
<li><a href="#org5012767">17.2. Method</a></li>
</ul>
</li>
<li><a href="#org63b87f2">18. Pork ribs</a>
<ul>
<li><a href="#org4ab92e5">18.1. Ingredients</a></li>
<li><a href="#org306fa41">18.2. Method</a></li>
</ul>
</li>
<li><a href="#org8d2ad0e">19. Beef and Ale Pie</a>
<ul>
<li><a href="#orgf8aae03">19.1. Ingredients</a>
<ul>
<li><a href="#org009fa91">19.1.1. Meat</a></li>
<li><a href="#orge6f22bc">19.1.2. For the pastry</a></li>
</ul>
</li>
<li><a href="#org9bfc0cd">19.2. Method</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1581a8f" class="outline-2">
<h2 id="org1581a8f"><span class="section-number-2">1</span> Copycat KFC</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org31d7e18" class="outline-3">
<h3 id="org31d7e18"><span class="section-number-3">1.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>1 whole chicken (2 breasts, 2 thighs, 2 drumsticks, 2 wings)</li>
<li>2 quarts neutral oil, for frying</li>
<li>1 egg white</li>
<li>1 1/2 cups all-purpose flour</li>
<li>1 tablespoon brown sugar</li>
<li>1 tablespoon kosher salt</li>
<li>1 tablespoon paprika</li>
<li>2 teaspoons onion salt</li>
<li>1 teaspoon chili powder</li>
<li>1 teaspoon black pepper</li>
<li>1/2 teaspoon celery salt</li>
<li>1/2 teaspoon dried sage</li>
<li>1/2 teaspoon garlic powder</li>
<li>1/2 teaspoon ground allspice</li>
<li>1/2 teaspoon dried oregano</li>
<li>1/2 teaspoon dried basil</li>
<li>1/2 teaspoon dried marjoram</li>
</ul>
</div>
</div>
<div id="outline-container-org3b0fc6e" class="outline-3">
<h3 id="org3b0fc6e"><span class="section-number-3">1.2</span> Method</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Preheat fryer to 150°C. Thoroughly mix together all the spice mix
ingredients.</li>
<li>Combine spice mix with flour, brown sugar and salt.</li>
<li>Dip chicken pieces in egg white to lightly coat them, then transfer
to flour mixture. Turn a few times and make sure the flour mix is
really stuck to the chicken. Repeat with all the chicken pieces.</li>
<li>Let chicken pieces rest for 5 minutes so crust has a chance to dry a
bit.</li>
<li>Fry chicken in batches. Breasts and wings should take 15 minutes, and
legs and thighs will need 20 minutes. Chicken pieces are done when a
meat thermometer inserted into the thickest part reads 165°F.</li>
<li>Let chicken drain on a few paper towels when it comes out of the
fryer. Serve hot.</li>
</ol>
</div>
</div>
<div id="outline-container-orgefbc359" class="outline-3">
<h3 id="orgefbc359"><span class="section-number-3">1.3</span> Notes</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgdb8adb1" class="outline-4">
<h4 id="orgdb8adb1"><span class="section-number-4">1.3.1</span> 2018-03-08</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>Tried doubling all spices (not flour)</li>
<li>2 egg whites</li>
<li><b>Didn't work</b></li>
</ul>
</div>
</div>
<div id="outline-container-orgc63e5b1" class="outline-4">
<h4 id="orgc63e5b1"><span class="section-number-4">1.3.2</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-04-29 Sun&gt;</span></span></h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>cooked for 15 minutes for breast and 20 minutes for legs and thighs on
150 degrees</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orga8d9b69" class="outline-2">
<h2 id="orga8d9b69"><span class="section-number-2">2</span> Salsa</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8122da0" class="outline-3">
<h3 id="org8122da0"><span class="section-number-3">2.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>6 ripe tomatoes</li>
<li>1 red pepper</li>
<li>1 big bunch of fresh coriander</li>
<li>1 onion</li>
<li>2 fresh jalapeño or green chillies</li>
<li>1 large clove of garlic</li>
<li>1 lime</li>
<li>extra virgin olive oil</li>
<li>1tsp salt</li>
</ul>
</div>
</div>
<div id="outline-container-org563c9fd" class="outline-3">
<h3 id="org563c9fd"><span class="section-number-3">2.2</span> Method</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Finely chop the tomatoes and coriander (stalks and all) and place into
a large bowl.</li>
<li>Peel and finely chop the onion, deseed and finely chop the chillies,
then scrape into the bowl. Peel and finely grate in the garlic.</li>
<li>Squeeze in the juice from 1 lime, add 2 tablespoons of extra virgin
olive oil, and mix well. Season to taste with sea salt, black pepper
and more lime juice, if needed.</li>
<li>Serve straightaway or cover and set aside for a few hours to let all
those flavours develop.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge20520b" class="outline-2">
<h2 id="orge20520b"><span class="section-number-2">3</span> Tacos</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb4a3c3b" class="outline-3">
<h3 id="orgb4a3c3b"><span class="section-number-3">3.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>500g beef mince</li>
<li>1 onion, chopped</li>
<li>1 green pepper, chopped</li>
<li>1 garlic clove, crushed</li>
<li>2 teaspoon hot paprika</li>
<li>2 teaspoon ground cumin</li>
<li>1/2 teaspoon dried red chilli flakes</li>
<li>1/2 teasponn of cayenne pepper</li>
<li>6 tablespoons tomato puree</li>
<li>12 flour tortillas or taco shells</li>
<li>peanut oil, for frying</li>
<li>1 tsp salt</li>
<li>1 tsp course ground peppper</li>
</ul>
</div>
</div>
<div id="outline-container-org118c7ee" class="outline-3">
<h3 id="org118c7ee"><span class="section-number-3">3.2</span> Method</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Dry-fry the mince in a frying pan until brown and crumbly, stirring
occasionally and breaking it up with a wooden spoon.</li>
<li>Add the onion, green pepper and garlic; cook, stirring occasionally,
until softened. Stir in the herbs and spices; season to taste with
salt and pepper. Add the tomato puree and mix well. Cover and cook
gently for 10 minutes, stirring occasionally.</li>
<li>Place a little of the mixture on each tortilla and roll up, or spoon
into the taco shells. Secure tortillas with a cocktail stick. If using
tortillas, heat the oil in a frying pan and then fry the rolls quickly
until golden. Serve with your choice of accompaniments.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb166b3a" class="outline-2">
<h2 id="orgb166b3a"><span class="section-number-2">4</span> Fajitas</h2>
</div>
<div id="outline-container-org332dbe9" class="outline-2">
<h2 id="org332dbe9"><span class="section-number-2">5</span> Hot wings</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org19a7f9f" class="outline-3">
<h3 id="org19a7f9f"><span class="section-number-3">5.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>3/4 cup all-purpose flour</li>
<li>1/2 teaspoon cayenne pepper</li>
<li>1/2 teaspoon garlic powder</li>
<li>1/2 teaspoon salt</li>
<li>20 chicken wings</li>
<li>1/2 cup melted butter (100g)</li>
<li>1/2 cup hot pepper sauce (such as Frank's RedHot®)</li>
</ul>
</div>
</div>
