output/pages/recipes/recipes.org
*** Method
- Line a baking sheet with aluminum foil, and lightly grease with
  cooking spray. Place the flour, cayenne pepper, garlic powder, and
  salt into a resealable plastic bag, and shake to mix. Add the chicken
  wings, seal, and toss until well coated with the flour mixture. Place
  the wings onto the prepared baking sheet, and place into the
  refrigerator. Refrigerate at least 1 hour.
- Preheat oven to 400 degrees F (200 degrees C).
- Whisk together the melted butter and hot sauce in a small bowl. Dip
  the wings into the butter mixture, and place back on the baking sheet.
  Bake in the preheated oven until the chicken is no longer pink
** Beef Pad Thai
*** Ingredients
- 1 cup dry roasted peanuts
- 1⁄3 cup water
- 1 garlic clove, minced
- 1⁄2 teaspoon dark soy sauce
- 2 teaspoons sesame oil
- 2 tablespoons brown sugar
- 1⁄4 teaspoon red pepper flakes (more or less to taste)
- 2 tablespoons asian fish sauce (If vegetarian, use vegetarian fish
  sauce or regular soy sauce)
- 1⁄2 teaspoon tahini paste
- 1 teaspoon red chili sauce (more or less to taste)
- 1 teaspoon lime juice
- lime zest
- 1 tablespoon peanut oil
- 1 teaspoon peeled and minced fresh ginger (you can find this in the
  oriental section of your grocery store) or 1 teaspoon sliced ginger in
  a jar (you can find this in the oriental section of your grocery
  store)
- 2 garlic cloves, minced
- 3 -4 tablespoons teriyaki sauce
- 1 cup cremini mushrooms, sliced or 1 cup shiitake mushroom
- 1 onion, sliced small onion, into long thin slices work best
- 1 lb lean beef steak, cut crosswise into 1/4 inch strips (such as
  sirloin tip or flank)
- 1⁄4 cup chopped dry roasted peanuts
- 1⁄4 cup chopped scallion (3-4 scallions, white & green parts)
- 8 ounces somen noodles or 8 ounces soba noodles, noodes or 8 ounces
  whole-wheat spaghetti
*** Instructions
**** Thai Peanut Sauce Preparation:
- Place the first 12 ingredients (from the peanuts to the lime zest), in
  a blender.
- Blend until sauce is smooth. If you prefer a runnier peanut sauce, add
  a little more water. Do a taste test for salt and spice, adding more
  fish sauce if not salty enough, and more chili sauce &/or red pepper
  flakes, if not spicy enough. If too salty, add another squeeze of
  fresh limejuice.
**** Beef Pad Thai Preparation:
- Cook the noodles according to the package directions. Drain, transfer
  to a large bowl, and cover with aluminum foil or plastic wrap to keep
  warm.
- Heat the peanut oil in a large skillet over medium-high heat. Add the
  ginger and garlic - cook, stirring, for 2 minutes. Add the sliced
  onions & mushrooms, stir-fry for 2 minutes. Add the beef and stir-fry
  another 2 minutes. Next, add the teriyaki sauce & a 1/2 cup of the
  Thai peanut sauce, stir all together, and simmer until the beef is
  cooked through, about 4-5 minutes.
- Transfer the noodles to the beef mixture & toss to combine. Serve on
  individual plates topped with the peanuts and scallions. The leftover
  peanut sauce will keep in the refrigerator up to 4 days or in the
  freezer up to 3 months; thaw completely in the refrigerator or
  microwave for about 3 minutes on LOW before using.
** Silverside Roast Beef
*** Ingredints
- Silver side beef joint
- 1 tbsp beef dripping or butter
- 1 tsp salt and some freshly ground black pepper
- 8-12 small red onions, peeled and slit in a cross at the pointed end
  (so that they do not burst in the oven)
- 4 heads garlic, halved horizontally
- A few sprigs of thyme
- Buttered spinach to serve.
- Celery stick
*** Method
- Preheat the oven to 210°C. Rub the rolled silverside joint with the
  beef dripping and sprinkle with plenty of salt and pepper.
- Add onions and garlic, thyme and celery - chopped but not peeled to
  the base of the tin as a trivet. Place beef on top.
- Place into the hot oven for 25 minutes to brown. Then reduce the oven
  temperature to 180°C.
- Add 100 ml of water.
- Cover with foil and cook , basting from time to time and adding a
  little more water if necessary. This will keep the meat moist.
  Re-cover with the foil each time.
- Cook for 25 mins per 450g in total
- Uncover the meat for the last 15 minutes of cooking.
- Remove the meat to a warm serving dish with the onions and garlic,
  cover well and keep it warm.
- Slice the beef and serve a couple of slices per person with the soft
  onions, a piece of garlic, the Yorkshire puddings and a spoon or two
  of gravy and your favourite green leafy vegetable, such as spinach.
*** Notes
<2018-04-29 Sun>
- 15:55 Beef in
- 16:20 beef turned down
- 17:00 Start cooking potatoes
- 17:40 Potatoes in oven
- 17:45 Uncover meat and turn up oven to 210
- 18:00 peas and carrots
- 18:00 flip potatoes
- 18:00 beef out to rest
- 18:00 Start Yorkshire puddings
- 18:20 Yorkshire puddings out
- *Yorkshires were shit - find another recepie*
** Crispy Pork Belly
*** Ingredients
- 1/2 pound whole pork belly, skin removed
- 1/2 teaspoon smoked paprika, or to taste
- kosher salt and ground black pepper to taste
- 1 tablespoon olive oil, or to taste
*** Method
- Preheat oven to 200 degrees F (95 degrees C).
- Season pork belly all over with smoked paprika, salt, and black
  pepper. Wrap pork in parchment paper; wrap a second time in aluminum
  foil, and a third time in another sheet of aluminum foil. Place pork
  packet in a baking dish.
- Roast in the preheated oven until tender for 6 hours. Let cool in
  wrappings to room temperature; place cooled packet in refrigerator and
  chill for 8 hours or overnight.
- Unwrap chilled meat. Save any rendered fat that falls away when
  unwrapping pork.
- Cut meat into 6 equal-size portions. Cut 1/8-inch by 1/8-inch slashes
  in the fat-side of the pork. Season with salt.
- Heat 2 tablespoons reserved pork fat in a skillet over medium heat.
  Place pork belly, fat side down, in hot fat; cook until well-browned
  on all sides and heated through, 5 to 10 minutes. Transfer pork belly
  to a plate, drizzle with olive oil and season with pepper.
** Yorkshire Puddings
*** Ingredients
- 4oz Flour
- 8oz Milk
- 2 eggs
- pinch salt
- Tbsp Oil
