output/pages/recipes/recipes.html
<div id="outline-container-orgcb7ed32" class="outline-3">
<h3 id="orgcb7ed32"><span class="section-number-3">5.2</span> Method</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Line a baking sheet with aluminum foil, and lightly grease with
cooking spray. Place the flour, cayenne pepper, garlic powder, and
salt into a resealable plastic bag, and shake to mix. Add the chicken
wings, seal, and toss until well coated with the flour mixture. Place
the wings onto the prepared baking sheet, and place into the
refrigerator. Refrigerate at least 1 hour.</li>
<li>Preheat oven to 400 degrees F (200 degrees C).</li>
<li>Whisk together the melted butter and hot sauce in a small bowl. Dip
the wings into the butter mixture, and place back on the baking sheet.
Bake in the preheated oven until the chicken is no longer pink</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8171228" class="outline-2">
<h2 id="org8171228"><span class="section-number-2">6</span> Beef Pad Thai</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgcd08b33" class="outline-3">
<h3 id="orgcd08b33"><span class="section-number-3">6.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>1 cup dry roasted peanuts</li>
<li>1⁄3 cup water</li>
<li>1 garlic clove, minced</li>
<li>1⁄2 teaspoon dark soy sauce</li>
<li>2 teaspoons sesame oil</li>
<li>2 tablespoons brown sugar</li>
<li>1⁄4 teaspoon red pepper flakes (more or less to taste)</li>
<li>2 tablespoons asian fish sauce (If vegetarian, use vegetarian fish
sauce or regular soy sauce)</li>
<li>1⁄2 teaspoon tahini paste</li>
<li>1 teaspoon red chili sauce (more or less to taste)</li>
<li>1 teaspoon lime juice</li>
<li>lime zest</li>
<li>1 tablespoon peanut oil</li>
<li>1 teaspoon peeled and minced fresh ginger (you can find this in the
oriental section of your grocery store) or 1 teaspoon sliced ginger in
a jar (you can find this in the oriental section of your grocery
store)</li>
<li>2 garlic cloves, minced</li>
<li>3 -4 tablespoons teriyaki sauce</li>
<li>1 cup cremini mushrooms, sliced or 1 cup shiitake mushroom</li>
<li>1 onion, sliced small onion, into long thin slices work best</li>
<li>1 lb lean beef steak, cut crosswise into 1/4 inch strips (such as
sirloin tip or flank)</li>
<li>1⁄4 cup chopped dry roasted peanuts</li>
<li>1⁄4 cup chopped scallion (3-4 scallions, white &amp; green parts)</li>
<li>8 ounces somen noodles or 8 ounces soba noodles, noodes or 8 ounces
whole-wheat spaghetti</li>
</ul>
</div>
</div>
<div id="outline-container-orgb8d4be2" class="outline-3">
<h3 id="orgb8d4be2"><span class="section-number-3">6.2</span> Instructions</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org058aaad" class="outline-4">
<h4 id="org058aaad"><span class="section-number-4">6.2.1</span> Thai Peanut Sauce Preparation:</h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li>Place the first 12 ingredients (from the peanuts to the lime zest), in
a blender.</li>
<li>Blend until sauce is smooth. If you prefer a runnier peanut sauce, add
a little more water. Do a taste test for salt and spice, adding more
fish sauce if not salty enough, and more chili sauce &amp;/or red pepper
flakes, if not spicy enough. If too salty, add another squeeze of
fresh limejuice.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf9a02ea" class="outline-4">
<h4 id="orgf9a02ea"><span class="section-number-4">6.2.2</span> Beef Pad Thai Preparation:</h4>
<div class="outline-text-4" id="text-6-2-2">
<ul class="org-ul">
<li>Cook the noodles according to the package directions. Drain, transfer
to a large bowl, and cover with aluminum foil or plastic wrap to keep
warm.</li>
<li>Heat the peanut oil in a large skillet over medium-high heat. Add the
ginger and garlic - cook, stirring, for 2 minutes. Add the sliced
onions &amp; mushrooms, stir-fry for 2 minutes. Add the beef and stir-fry
another 2 minutes. Next, add the teriyaki sauce &amp; a 1/2 cup of the
Thai peanut sauce, stir all together, and simmer until the beef is
cooked through, about 4-5 minutes.</li>
<li>Transfer the noodles to the beef mixture &amp; toss to combine. Serve on
individual plates topped with the peanuts and scallions. The leftover
peanut sauce will keep in the refrigerator up to 4 days or in the
freezer up to 3 months; thaw completely in the refrigerator or
microwave for about 3 minutes on LOW before using.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org1556fd2" class="outline-2">
<h2 id="org1556fd2"><span class="section-number-2">7</span> Silverside Roast Beef</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgef0d47c" class="outline-3">
<h3 id="orgef0d47c"><span class="section-number-3">7.1</span> Ingredints</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Silver side beef joint</li>
<li>1 tbsp beef dripping or butter</li>
<li>1 tsp salt and some freshly ground black pepper</li>
<li>8-12 small red onions, peeled and slit in a cross at the pointed end
(so that they do not burst in the oven)</li>
<li>4 heads garlic, halved horizontally</li>
<li>A few sprigs of thyme</li>
<li>Buttered spinach to serve.</li>
<li>Celery stick</li>
</ul>
</div>
</div>
<div id="outline-container-orgffbf132" class="outline-3">
<h3 id="orgffbf132"><span class="section-number-3">7.2</span> Method</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Preheat the oven to 210°C. Rub the rolled silverside joint with the
beef dripping and sprinkle with plenty of salt and pepper.</li>
<li>Add onions and garlic, thyme and celery - chopped but not peeled to
the base of the tin as a trivet. Place beef on top.</li>
<li>Place into the hot oven for 25 minutes to brown. Then reduce the oven
temperature to 180°C.</li>
<li>Add 100 ml of water.</li>
<li>Cover with foil and cook , basting from time to time and adding a
little more water if necessary. This will keep the meat moist.
Re-cover with the foil each time.</li>
<li>Cook for 25 mins per 450g in total</li>
<li>Uncover the meat for the last 15 minutes of cooking.</li>
<li>Remove the meat to a warm serving dish with the onions and garlic,
cover well and keep it warm.</li>
<li>Slice the beef and serve a couple of slices per person with the soft
onions, a piece of garlic, the Yorkshire puddings and a spoon or two
of gravy and your favourite green leafy vegetable, such as spinach.</li>
</ul>
</div>
</div>
<div id="outline-container-org0c90598" class="outline-3">
<h3 id="org0c90598"><span class="section-number-3">7.3</span> Notes</h3>
<div class="outline-text-3" id="text-7-3">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2018-04-29 Sun&gt;</span></span>
</p>
<ul class="org-ul">
<li>15:55 Beef in</li>
<li>16:20 beef turned down</li>
<li>17:00 Start cooking potatoes</li>
<li>17:40 Potatoes in oven</li>
<li>17:45 Uncover meat and turn up oven to 210</li>
<li>18:00 peas and carrots</li>
<li>18:00 flip potatoes</li>
<li>18:00 beef out to rest</li>
<li>18:00 Start Yorkshire puddings</li>
<li>18:20 Yorkshire puddings out</li>
<li><b>Yorkshires were shit - find another recepie</b></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2e68cb6" class="outline-2">
<h2 id="org2e68cb6"><span class="section-number-2">8</span> Crispy Pork Belly</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org72d6ae6" class="outline-3">
<h3 id="org72d6ae6"><span class="section-number-3">8.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>1/2 pound whole pork belly, skin removed</li>
<li>1/2 teaspoon smoked paprika, or to taste</li>
<li>kosher salt and ground black pepper to taste</li>
<li>1 tablespoon olive oil, or to taste</li>
</ul>
</div>
</div>
<div id="outline-container-orgfec5525" class="outline-3">
<h3 id="orgfec5525"><span class="section-number-3">8.2</span> Method</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Preheat oven to 200 degrees F (95 degrees C).</li>
<li>Season pork belly all over with smoked paprika, salt, and black
pepper. Wrap pork in parchment paper; wrap a second time in aluminum
foil, and a third time in another sheet of aluminum foil. Place pork
packet in a baking dish.</li>
<li>Roast in the preheated oven until tender for 6 hours. Let cool in
wrappings to room temperature; place cooled packet in refrigerator and
chill for 8 hours or overnight.</li>
<li>Unwrap chilled meat. Save any rendered fat that falls away when
unwrapping pork.</li>
<li>Cut meat into 6 equal-size portions. Cut 1/8-inch by 1/8-inch slashes
in the fat-side of the pork. Season with salt.</li>
<li>Heat 2 tablespoons reserved pork fat in a skillet over medium heat.
Place pork belly, fat side down, in hot fat; cook until well-browned
on all sides and heated through, 5 to 10 minutes. Transfer pork belly
to a plate, drizzle with olive oil and season with pepper.</li>
</ul>
</div>
</div>
</div>
