output/pages/recipes/recipes.org
*** Method
- Oven temperature to 210°C.
- In a large bowl mix the flour and salt, make a well in the centre,
  break in the eggs and hand whisk in half the liquid, gradually
  incorporating the flour as you whisk until you have a smooth thick
  batter with no lumps.
- Stir in the remaining liquid and leave to stand.
- Put 1/2 a teaspoon of beef dripping into each of the muffin cups.
- Place the muffin tin in the oven until the fat is very hot, stir the
  batter well, then 2/3 fill each muffin cup and return to the oven for
  about 20 minutes until well risen and golden brown. They should feel
  firm and in no danger of collapse, so leave them in a little longer if
  necessary.
** Roast Poatoes
*** Ingredients
- Potatoes
- 2 tbsp plain flour
- 3 tbsp sunflower oil
*** Method
- An hour before roast is ready, start the potatoes
- Peel and halve potatoes and bring to boil in a pan of cold water. Boil
  for 2 minutes exactly.
- Drain potatoes and toss in colinder, adding flour.
- Add oil to a roasting tin over high heat, when sizzling add potatoes
  and cook for 5 minutes, ensuring even coating of oil
- Roast undistrubed for 20 min, then turn and roast for another 20
  minutes.
*** Notes
  - Used Gooes fat - and worked amazingly well
** Gravy
*** Ingredients
- 100 ml red/white wine
- 100 ml water
- 1 tbsp Dijon or English mustard
*** Method
- Discard any fat from the surface of the pan juices, and with the pan
  over a medium heat stir in the wine and gather up all the sticky bits,
  add the water and the port or redcurrant jelly and when melted simmer
  to reduce the liquid a little.
- Add the mustard and stir until thickened. Taste and season as
  necessary.
** Sauteed Kale
*** Ingredients
- 1 pound kale leaves (dark green, stem removed and leaves chopped, then
  washed and dried)
- 1 tablespoon extra-virgin olive oil (or slightly more, depending on
  your pan)
- 1 red onion (chopped in small pieces, or use about 1/2 cup chopped
  shallots)
- 2 cloves garlic (fresh, very finely minced)
- 2 cups water (added 1/2 cup at a time)
- 1 tbsp white wine vinegar
*** Method
- Chop the onion or shallots and finely mince the garlic, then heat oil
  in heavy frying pan until it's medium-hot and saute onion 3-4 minutes
  until it starts to brown. When onion is turning slightly brown, add
  garlic and saute 1 minute more.
- While onions and garlic cook, cut away the center rib from each kale
  leaf and discard. Chop or tear the kale leaves into bite-sized pieces,
  then wash and spin dry or dry with paper towels.
- Add chopped kale leaves to the browned onion/garlic mixture, season
  generously with salt and fresh ground black pepper, and let the kale
  wilt for 2-3 minutes, then add 1/2 cup water, stir, and let the kale
  cook in the water until the pan is almost dry, about 5-10 minutes.
- Add 1/2 cup more water and cook kale 5-10 minutes more, then add a
  third 1/2 cup of water and cook kale 5-10 minutes more. After you've
  added water and cooked it off three times, taste to see if the kale is
  tender; if not, add water one more time and cook a bit longer.
- When kale is melt-in-your-mouth tender and the pan is nearly dry,
  season as desired with vinegar and serve hot or warm.
** French Fries
*** Ingredients
- 8 cups cold water
- 2 tablespoons fine sea salt
- 2 1⁄2 teaspoons granulated sugar
- 1 teaspoon white pepper
- 2 tablespoons white vinegar
*** Method
- PEEL 4 medium russet potatoes; CUT potatoes into 1/4" shoestrings (try
  to make them as uniform as possible; I use an adjustable-blade
  French-fry cutter).
- PLACE cut potatoes into the brine container; SEAL and refrigerate for
  at least 2 hours; BRING pot with brine and potatoes to a full boil;
  BOIL for 1 1/2-2 minutes; DRAIN and rinse potatoes under cold water;
  BLOT potatoes as dry as possible.
- PLACE potatoes side-by-side into freezer bags without touching, and
  without crowding; SEAL bags and freeze flat in refrigerator for at
  least 2 hours (just make sure fries are frozen solid).
- FILL deep-fryer with proper amount of beef tallow (or oil/shortening
  blend), to manufacturer's recommended amount; HEAT fryer in gradual
  increments to 375°F.
- PLACE 1/2 of the potatoes at a time into elevated deep-frying basket;
  GENTLY lower basket into hot fat.
- FRY for about 2 minutes but PAY ATTENTION TO THE COLOR -- potato color
  should be light golden brown with just slightly darker ends (see
  photo, and pull a french fry with tongs to test doneness if
  necessary); ELEVATE fry basket and shake to drain excess fat; SECURE
  basket and let drain for 30 seconds.
- TRANSFER fries into colander placed in sink; REPEAT with remaining
  potatoes.
** Burgers
*** Ingredients
- 1 egg
- 1 teaspoon mustard (regular or Dijon)
- 1 teaspoon Worcestershire sauce
- 1 small onion, finely grated
- 1 clove garlic, minced
- 1⁄2 teaspoon salt
- 1⁄2 teaspoon pepper
- 500g medium ground beef
**** Stirins
- 1 teaspoon dried mixed herbs
- 2 teaspoons cajun seasoning
- 1 tbsp fresh herbs
*** Method
- Lightly oil grill
- Whisk egg in a bowl& add next 6 ingredients.
- Add any of the “stir-ins” that appeal to you.
- Crumble in beef using your hands or a fork, gently mix together.
- Handle the meat as little as possible -- the more you work it, the
  tougher it gets.
- Gently shape (don't firmly press) mixture into burgers about ¾ inch
  thick.
- Heat up lightly oiled grill and when hot turn to medium heat (about 4
  minutes)
- Place burgers on the grill and cook 4 minutes on each side
- Tuck into a warm crusty bun add your favourite toppings.
** Peri Peri Chicken
