output/pages/recipes/recipes.html
<div id="outline-container-org6244bdd" class="outline-2">
<h2 id="org6244bdd"><span class="section-number-2">9</span> Yorkshire Puddings</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org6559889" class="outline-3">
<h3 id="org6559889"><span class="section-number-3">9.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>4oz Flour</li>
<li>8oz Milk</li>
<li>2 eggs</li>
<li>pinch salt</li>
<li>Tbsp Oil</li>
</ul>
</div>
</div>
<div id="outline-container-org12e5334" class="outline-3">
<h3 id="org12e5334"><span class="section-number-3">9.2</span> Method</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>Oven temperature to 210°C.</li>
<li>In a large bowl mix the flour and salt, make a well in the centre,
break in the eggs and hand whisk in half the liquid, gradually
incorporating the flour as you whisk until you have a smooth thick
batter with no lumps.</li>
<li>Stir in the remaining liquid and leave to stand.</li>
<li>Put 1/2 a teaspoon of beef dripping into each of the muffin cups.</li>
<li>Place the muffin tin in the oven until the fat is very hot, stir the
batter well, then 2/3 fill each muffin cup and return to the oven for
about 20 minutes until well risen and golden brown. They should feel
firm and in no danger of collapse, so leave them in a little longer if
necessary.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6352913" class="outline-2">
<h2 id="org6352913"><span class="section-number-2">10</span> Roast Poatoes</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org2e7b195" class="outline-3">
<h3 id="org2e7b195"><span class="section-number-3">10.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>Potatoes</li>
<li>2 tbsp plain flour</li>
<li>3 tbsp sunflower oil</li>
</ul>
</div>
</div>
<div id="outline-container-orge798e17" class="outline-3">
<h3 id="orge798e17"><span class="section-number-3">10.2</span> Method</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li>An hour before roast is ready, start the potatoes</li>
<li>Peel and halve potatoes and bring to boil in a pan of cold water. Boil
for 2 minutes exactly.</li>
<li>Drain potatoes and toss in colinder, adding flour.</li>
<li>Add oil to a roasting tin over high heat, when sizzling add potatoes
and cook for 5 minutes, ensuring even coating of oil</li>
<li>Roast undistrubed for 20 min, then turn and roast for another 20
minutes.</li>
</ul>
</div>
</div>
<div id="outline-container-orga2cd9ed" class="outline-3">
<h3 id="orga2cd9ed"><span class="section-number-3">10.3</span> Notes</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li>Used Gooes fat - and worked amazingly well</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3e968e6" class="outline-2">
<h2 id="org3e968e6"><span class="section-number-2">11</span> Gravy</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgeb7fa1a" class="outline-3">
<h3 id="orgeb7fa1a"><span class="section-number-3">11.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>100 ml red/white wine</li>
<li>100 ml water</li>
<li>1 tbsp Dijon or English mustard</li>
</ul>
</div>
</div>
<div id="outline-container-org806d0e5" class="outline-3">
<h3 id="org806d0e5"><span class="section-number-3">11.2</span> Method</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>Discard any fat from the surface of the pan juices, and with the pan
over a medium heat stir in the wine and gather up all the sticky bits,
add the water and the port or redcurrant jelly and when melted simmer
to reduce the liquid a little.</li>
<li>Add the mustard and stir until thickened. Taste and season as
necessary.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8df061a" class="outline-2">
<h2 id="org8df061a"><span class="section-number-2">12</span> Sauteed Kale</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org635ac59" class="outline-3">
<h3 id="org635ac59"><span class="section-number-3">12.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>1 pound kale leaves (dark green, stem removed and leaves chopped, then
washed and dried)</li>
<li>1 tablespoon extra-virgin olive oil (or slightly more, depending on
your pan)</li>
<li>1 red onion (chopped in small pieces, or use about 1/2 cup chopped
shallots)</li>
<li>2 cloves garlic (fresh, very finely minced)</li>
<li>2 cups water (added 1/2 cup at a time)</li>
<li>1 tbsp white wine vinegar</li>
</ul>
</div>
</div>
<div id="outline-container-org2a28b22" class="outline-3">
<h3 id="org2a28b22"><span class="section-number-3">12.2</span> Method</h3>
<div class="outline-text-3" id="text-12-2">
<ul class="org-ul">
<li>Chop the onion or shallots and finely mince the garlic, then heat oil
in heavy frying pan until it's medium-hot and saute onion 3-4 minutes
until it starts to brown. When onion is turning slightly brown, add
garlic and saute 1 minute more.</li>
<li>While onions and garlic cook, cut away the center rib from each kale
leaf and discard. Chop or tear the kale leaves into bite-sized pieces,
then wash and spin dry or dry with paper towels.</li>
<li>Add chopped kale leaves to the browned onion/garlic mixture, season
generously with salt and fresh ground black pepper, and let the kale
wilt for 2-3 minutes, then add 1/2 cup water, stir, and let the kale
cook in the water until the pan is almost dry, about 5-10 minutes.</li>
<li>Add 1/2 cup more water and cook kale 5-10 minutes more, then add a
third 1/2 cup of water and cook kale 5-10 minutes more. After you've
added water and cooked it off three times, taste to see if the kale is
tender; if not, add water one more time and cook a bit longer.</li>
<li>When kale is melt-in-your-mouth tender and the pan is nearly dry,
season as desired with vinegar and serve hot or warm.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb93476a" class="outline-2">
<h2 id="orgb93476a"><span class="section-number-2">13</span> French Fries</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org1ae05eb" class="outline-3">
<h3 id="org1ae05eb"><span class="section-number-3">13.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>8 cups cold water</li>
<li>2 tablespoons fine sea salt</li>
<li>2 1⁄2 teaspoons granulated sugar</li>
<li>1 teaspoon white pepper</li>
<li>2 tablespoons white vinegar</li>
</ul>
</div>
</div>
<div id="outline-container-org2170ab7" class="outline-3">
<h3 id="org2170ab7"><span class="section-number-3">13.2</span> Method</h3>
<div class="outline-text-3" id="text-13-2">
<ul class="org-ul">
<li>PEEL 4 medium russet potatoes; CUT potatoes into 1/4" shoestrings (try
to make them as uniform as possible; I use an adjustable-blade
French-fry cutter).</li>
<li>PLACE cut potatoes into the brine container; SEAL and refrigerate for
at least 2 hours; BRING pot with brine and potatoes to a full boil;
BOIL for 1 1/2-2 minutes; DRAIN and rinse potatoes under cold water;
BLOT potatoes as dry as possible.</li>
<li>PLACE potatoes side-by-side into freezer bags without touching, and
without crowding; SEAL bags and freeze flat in refrigerator for at
least 2 hours (just make sure fries are frozen solid).</li>
<li>FILL deep-fryer with proper amount of beef tallow (or oil/shortening
blend), to manufacturer's recommended amount; HEAT fryer in gradual
increments to 375°F.</li>
<li>PLACE 1/2 of the potatoes at a time into elevated deep-frying basket;
GENTLY lower basket into hot fat.</li>
<li>FRY for about 2 minutes but PAY ATTENTION TO THE COLOR &#x2013; potato color
should be light golden brown with just slightly darker ends (see
photo, and pull a french fry with tongs to test doneness if
necessary); ELEVATE fry basket and shake to drain excess fat; SECURE
basket and let drain for 30 seconds.</li>
<li>TRANSFER fries into colander placed in sink; REPEAT with remaining
potatoes.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org09c9e44" class="outline-2">
<h2 id="org09c9e44"><span class="section-number-2">14</span> Burgers</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orge234e56" class="outline-3">
<h3 id="orge234e56"><span class="section-number-3">14.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-14-1">
<ul class="org-ul">
<li>1 egg</li>
<li>1 teaspoon mustard (regular or Dijon)</li>
<li>1 teaspoon Worcestershire sauce</li>
<li>1 small onion, finely grated</li>
<li>1 clove garlic, minced</li>
<li>1⁄2 teaspoon salt</li>
<li>1⁄2 teaspoon pepper</li>
<li>500g medium ground beef</li>
</ul>
</div>
<div id="outline-container-org175aba5" class="outline-4">
<h4 id="org175aba5"><span class="section-number-4">14.1.1</span> Stirins</h4>
<div class="outline-text-4" id="text-14-1-1">
<ul class="org-ul">
<li>1 teaspoon dried mixed herbs</li>
<li>2 teaspoons cajun seasoning</li>
<li>1 tbsp fresh herbs</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbb71394" class="outline-3">
<h3 id="orgbb71394"><span class="section-number-3">14.2</span> Method</h3>
<div class="outline-text-3" id="text-14-2">
<ul class="org-ul">
<li>Lightly oil grill</li>
<li>Whisk egg in a bowl&amp; add next 6 ingredients.</li>
<li>Add any of the “stir-ins” that appeal to you.</li>
<li>Crumble in beef using your hands or a fork, gently mix together.</li>
<li>Handle the meat as little as possible &#x2013; the more you work it, the
tougher it gets.</li>
<li>Gently shape (don't firmly press) mixture into burgers about ¾ inch
thick.</li>
<li>Heat up lightly oiled grill and when hot turn to medium heat (about 4
minutes)</li>
<li>Place burgers on the grill and cook 4 minutes on each side</li>
<li>Tuck into a warm crusty bun add your favourite toppings.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5fdd92d" class="outline-2">
<h2 id="org5fdd92d"><span class="section-number-2">15</span> Peri Peri Chicken</h2>
<div class="outline-text-2" id="text-15">
</div>
