output/pages/recipes/recipes.org
*** Ingredients
- 4 chicken breasts (I used skinless and boneless)
- Salt and pepper to taste
- 2 tablespoons olive oil
- 2 cups peppers, chopped (I used red, yellow and orange)
- 4--6 thin slices of lemon
- 2 sprig fresh thyme
- 2 sprigs fresh rosemary
**** Peri Peri Marinade:
- 3 cloves garlic, peeled and roughly chopped
- 1/2 teaspoon crushed red pepper flakes
- 1 tablespoon smoked paprika
- 1/4 cup lime juice / 1 Large Lime
- 1/4 cup olive oil
- 1 tablespoon red wine vinegar
*** Method
- To make the peri-peri marinade: place all the ingredients in the bowl
  of a small food processor and process until puréed.
- Season chicken with salt and pepper to taste. Place the chicken in a
  large sealable plastic bag. Add the peri-peri marinade and close. Rub
  the bag to coat the chicken in the marinade then refrigerate for 4
  hours, or overnight.
- Preheat the oven to 200°C
- Remove the chicken from the bag and drain off the excess marinade.
  Reserve marinade.
- Heat oil in a skillet over medium-high heat. Place chicken in the
  skillet and brown each side until nice golden color. Turn off heat.
  Add reserved marinade, peppers, lemon slices, thyme, and rosemary,
  over the chicken. Cover the skillet with parchment paper.
- Bake for 20 - 30 minutes, or until the chicken reaches an internal
  temperature of 165º F in the thickness part. Cooking time will depend
  on the size of the chicken breasts. Remove from oven and allow to
  rest, covered, for 10 minutes.
- Serve with the lime wedges and pan juices.
** Garlic Rice
*** Ingredients
- 40g Salted Butter
- 9 to 12 Cloves garlic (approximately 2 heaping Tbs)
- 2 cups Jasmine rice
- 3 cups Water
- 1 Green onion
- Cilantro
*** Method
- Heat a large thick bottom pot that has lid over low heat. Add butter
  and let it slowly melt.
- Meanwhile roughly chop garlic and onion. Add into melted butter and
  increase heat to medium. Fry garlic for 4 to 5 minutes until garlic is
  golden brown and crispy. Stir occasionally so they will cook evenly.
  Be careful not to burn, it will give bitter flavor.
- Turn off heat and take fried garlic out on a plate with paper towel.
  Set aside.
- Turn back heat to medium; add rice into beautiful garlic infused
  butter. Stir to coat every single grain of rice with butter and toast
  them for 1 to 2 minutes until rice absorbed butter and toasted evenly.
  Stir occasionally.
- Add water; stir once and cover with lid. Increase heat to high and
  bring it to boil. When it starts boiling, reduce heat to low and stir
  one last time from bottom to top with an wooden spoon. Cover back on,
  simmer for 10 minutes.
- Remove from heat and let it sit for 10 extra minutes so rice will
  finish cooking. Don't open lid in this process, because rice will need
  all hot steam inside of pot to finish cooking.
- Meanwhile, chop green onion and some cilantro for garnish.
- Now, finally open and fluff rice from bottom to top with a spoon or
  fork. Garnish with chopped green onion, cilantro and fried garlic.
  Serve hot and let your guest to mix the rice and garnish. Enjoy!
** BBQ Brisket
*** Ingredients
- 1.5 -- 2 kg / 3 -- 4 lb beef brisket (Note 1)
- 500 ml/ 18 fl oz beef stock
**** Rub:
- 1 tbsp brown sugar
- 2 tsp paprika powder
- 1 tsp onion powder
- 1 tsp garlic powder
- 1/2 tsp cumin powder
- 3/4 tsp mustard powder
- 1 tsp salt
- 1/2 tsp black pepper

**** BBQ Sauce:
- 1 tbsp sunflower oil
- 1 small onion, finely chopped
- 3 garlic cloves, crushed
- 500 ml/ 18 fl oz tomato ketchup
- 100 ml/ 3½ fl oz Worcestershire sauce
- 75 ml/ 2½ fl oz lemon juice
- 2 tbsp brown sugar
- 1 tbsp malt vinegar
- 2 tsp Dijon mustard
- 1 tsp crushed chilli flakes
- 1 tsp Tabasco sauce
- 1 tsp dried thyme
*** Method
- To make the barbecue sauce, heat the oil in a frying pan, then cook
  onion and garlic for a few mins until soft. Add the rest of the sauce
  ingredients to the pan with a good pinch of salt and simmer for 20
  mins. Use a hand blender or food processor to whizz to a smooth purée.
- Heat oven to 150C/130C fan/gas 2. Make the rub by mixing all the
  ingredients together with a pinch of salt. Rub the mix all over the
  beef and set aside.
- In a large roasting tin, mix the beef stock and ½ the barbecue sauce.
  Add the brisket to the tin, cover tightly with foil, then cook for 4-5
  hrs until the meat is really tender when you push a fork into it. The
  beef can be prepared the night before -- just leave it to cool in the
  tin covered with foil, but don't refrigerate.
- To finish the beef, get a barbecue fired up and wait until the coals
  are completely ashen -- you want a low, not fierce, heat. Lift the
  beef out of the roasting tin and place on the barbecue to char. If
  your barbecue has a lid, close it now. Cook for about 20 mins, turning
  it carefully with tongs, until lightly charred all over and heated
  through. Lift onto a board and serve sliced with the remaining
  barbecue sauce on the side.
** Pork ribs
*** Ingredients
- 1/4 cup salt
- 1/4 cup white sugar
- 2 tablespoons brown sugar (packed)
- 2 tablespoons ground black pepper
- 2 tablespoons ground white pepper
- 2 tablespoons onion powder
- 1 tablespoon garlic powder
- 1 tablespoon chili powder
- 1 tablespoon paprika
- 1 tablespoon ground cumin
- 10 pounds pork baby back ribs
- 1 cup apple juice
- 1/4 cup brown sugar (packed)
- 1/4 cup barbecue sauce
