output/pages/recipes/recipes.html
<div id="outline-container-orge5ce02f" class="outline-3">
<h3 id="orge5ce02f"><span class="section-number-3">15.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-15-1">
<ul class="org-ul">
<li>4 chicken breasts (I used skinless and boneless)</li>
<li>Salt and pepper to taste</li>
<li>2 tablespoons olive oil</li>
<li>2 cups peppers, chopped (I used red, yellow and orange)</li>
<li>4&#x2013;6 thin slices of lemon</li>
<li>2 sprig fresh thyme</li>
<li>2 sprigs fresh rosemary</li>
</ul>
</div>
<div id="outline-container-org9520fd2" class="outline-4">
<h4 id="org9520fd2"><span class="section-number-4">15.1.1</span> Peri Peri Marinade:</h4>
<div class="outline-text-4" id="text-15-1-1">
<ul class="org-ul">
<li>3 cloves garlic, peeled and roughly chopped</li>
<li>1/2 teaspoon crushed red pepper flakes</li>
<li>1 tablespoon smoked paprika</li>
<li>1/4 cup lime juice / 1 Large Lime</li>
<li>1/4 cup olive oil</li>
<li>1 tablespoon red wine vinegar</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6c9d7e5" class="outline-3">
<h3 id="org6c9d7e5"><span class="section-number-3">15.2</span> Method</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li>To make the peri-peri marinade: place all the ingredients in the bowl
of a small food processor and process until puréed.</li>
<li>Season chicken with salt and pepper to taste. Place the chicken in a
large sealable plastic bag. Add the peri-peri marinade and close. Rub
the bag to coat the chicken in the marinade then refrigerate for 4
hours, or overnight.</li>
<li>Preheat the oven to 200°C</li>
<li>Remove the chicken from the bag and drain off the excess marinade.
Reserve marinade.</li>
<li>Heat oil in a skillet over medium-high heat. Place chicken in the
skillet and brown each side until nice golden color. Turn off heat.
Add reserved marinade, peppers, lemon slices, thyme, and rosemary,
over the chicken. Cover the skillet with parchment paper.</li>
<li>Bake for 20 - 30 minutes, or until the chicken reaches an internal
temperature of 165º F in the thickness part. Cooking time will depend
on the size of the chicken breasts. Remove from oven and allow to
rest, covered, for 10 minutes.</li>
<li>Serve with the lime wedges and pan juices.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org834f549" class="outline-2">
<h2 id="org834f549"><span class="section-number-2">16</span> Garlic Rice</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org8dd0085" class="outline-3">
<h3 id="org8dd0085"><span class="section-number-3">16.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-16-1">
<ul class="org-ul">
<li>40g Salted Butter</li>
<li>9 to 12 Cloves garlic (approximately 2 heaping Tbs)</li>
<li>2 cups Jasmine rice</li>
<li>3 cups Water</li>
<li>1 Green onion</li>
<li>Cilantro</li>
</ul>
</div>
</div>
<div id="outline-container-org737e37b" class="outline-3">
<h3 id="org737e37b"><span class="section-number-3">16.2</span> Method</h3>
<div class="outline-text-3" id="text-16-2">
<ul class="org-ul">
<li>Heat a large thick bottom pot that has lid over low heat. Add butter
and let it slowly melt.</li>
<li>Meanwhile roughly chop garlic and onion. Add into melted butter and
increase heat to medium. Fry garlic for 4 to 5 minutes until garlic is
golden brown and crispy. Stir occasionally so they will cook evenly.
Be careful not to burn, it will give bitter flavor.</li>
<li>Turn off heat and take fried garlic out on a plate with paper towel.
Set aside.</li>
<li>Turn back heat to medium; add rice into beautiful garlic infused
butter. Stir to coat every single grain of rice with butter and toast
them for 1 to 2 minutes until rice absorbed butter and toasted evenly.
Stir occasionally.</li>
<li>Add water; stir once and cover with lid. Increase heat to high and
bring it to boil. When it starts boiling, reduce heat to low and stir
one last time from bottom to top with an wooden spoon. Cover back on,
simmer for 10 minutes.</li>
<li>Remove from heat and let it sit for 10 extra minutes so rice will
finish cooking. Don't open lid in this process, because rice will need
all hot steam inside of pot to finish cooking.</li>
<li>Meanwhile, chop green onion and some cilantro for garnish.</li>
<li>Now, finally open and fluff rice from bottom to top with a spoon or
fork. Garnish with chopped green onion, cilantro and fried garlic.
Serve hot and let your guest to mix the rice and garnish. Enjoy!</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd64b4d6" class="outline-2">
<h2 id="orgd64b4d6"><span class="section-number-2">17</span> BBQ Brisket</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-org0f9ce45" class="outline-3">
<h3 id="org0f9ce45"><span class="section-number-3">17.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-17-1">
<ul class="org-ul">
<li>1.5 &#x2013; 2 kg / 3 &#x2013; 4 lb beef brisket (Note 1)</li>
<li>500 ml/ 18 fl oz beef stock</li>
</ul>
</div>
<div id="outline-container-orgde69785" class="outline-4">
<h4 id="orgde69785"><span class="section-number-4">17.1.1</span> Rub:</h4>
<div class="outline-text-4" id="text-17-1-1">
<ul class="org-ul">
<li>1 tbsp brown sugar</li>
<li>2 tsp paprika powder</li>
<li>1 tsp onion powder</li>
<li>1 tsp garlic powder</li>
<li>1/2 tsp cumin powder</li>
<li>3/4 tsp mustard powder</li>
<li>1 tsp salt</li>
<li>1/2 tsp black pepper</li>
</ul>
</div>
</div>

<div id="outline-container-org55f58b1" class="outline-4">
<h4 id="org55f58b1"><span class="section-number-4">17.1.2</span> BBQ Sauce:</h4>
<div class="outline-text-4" id="text-17-1-2">
<ul class="org-ul">
<li>1 tbsp sunflower oil</li>
<li>1 small onion, finely chopped</li>
<li>3 garlic cloves, crushed</li>
<li>500 ml/ 18 fl oz tomato ketchup</li>
<li>100 ml/ 3½ fl oz Worcestershire sauce</li>
<li>75 ml/ 2½ fl oz lemon juice</li>
<li>2 tbsp brown sugar</li>
<li>1 tbsp malt vinegar</li>
<li>2 tsp Dijon mustard</li>
<li>1 tsp crushed chilli flakes</li>
<li>1 tsp Tabasco sauce</li>
<li>1 tsp dried thyme</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5012767" class="outline-3">
<h3 id="org5012767"><span class="section-number-3">17.2</span> Method</h3>
<div class="outline-text-3" id="text-17-2">
<ul class="org-ul">
<li>To make the barbecue sauce, heat the oil in a frying pan, then cook
onion and garlic for a few mins until soft. Add the rest of the sauce
ingredients to the pan with a good pinch of salt and simmer for 20
mins. Use a hand blender or food processor to whizz to a smooth purée.</li>
<li>Heat oven to 150C/130C fan/gas 2. Make the rub by mixing all the
ingredients together with a pinch of salt. Rub the mix all over the
beef and set aside.</li>
<li>In a large roasting tin, mix the beef stock and ½ the barbecue sauce.
Add the brisket to the tin, cover tightly with foil, then cook for 4-5
hrs until the meat is really tender when you push a fork into it. The
beef can be prepared the night before &#x2013; just leave it to cool in the
tin covered with foil, but don't refrigerate.</li>
<li>To finish the beef, get a barbecue fired up and wait until the coals
are completely ashen &#x2013; you want a low, not fierce, heat. Lift the
beef out of the roasting tin and place on the barbecue to char. If
your barbecue has a lid, close it now. Cook for about 20 mins, turning
it carefully with tongs, until lightly charred all over and heated
through. Lift onto a board and serve sliced with the remaining
barbecue sauce on the side.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org63b87f2" class="outline-2">
<h2 id="org63b87f2"><span class="section-number-2">18</span> Pork ribs</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org4ab92e5" class="outline-3">
<h3 id="org4ab92e5"><span class="section-number-3">18.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-18-1">
<ul class="org-ul">
<li>1/4 cup salt</li>
<li>1/4 cup white sugar</li>
<li>2 tablespoons brown sugar (packed)</li>
<li>2 tablespoons ground black pepper</li>
<li>2 tablespoons ground white pepper</li>
<li>2 tablespoons onion powder</li>
<li>1 tablespoon garlic powder</li>
<li>1 tablespoon chili powder</li>
<li>1 tablespoon paprika</li>
<li>1 tablespoon ground cumin</li>
<li>10 pounds pork baby back ribs</li>
<li>1 cup apple juice</li>
<li>1/4 cup brown sugar (packed)</li>
<li>1/4 cup barbecue sauce</li>
</ul>
</div>
</div>
