output/pages/recipes/recipes.org
*** Method
- Stir salt, white sugar, 2 tablespoons brown sugar, black pepper, white
  pepper, onion powder, garlic powder, chili powder, paprika, and cumin
  together in a small bowl to make the dry rub. Rub the spice mixture
  into the baby back ribs on all sides. Wrap the ribs well with plastic
  wrap, and refrigerate for at least 30 minutes prior to cooking.
- Unwrap baby back ribs and place onto the wire racks of the smoker in a
  single layer.
- Place the racks into a smoker, fill the smoker pan with apple, grape,
  pear, or cherry chips, and bring the smoker to 270 degrees F (130
  degrees C). Smoke for 1 hour.
- Stir together the apple juice, 1/4 cup brown sugar, and the barbeque
  sauce. Brush the ribs with the sauce every 30 to 45 minutes after the
  first hour. Cook the ribs in the smoker until the meat is no longer
  pink and begins to "shrink" back from the bones, 3 to 4 hours. Brush
  the sauce onto the ribs one last time 30 minutes before the ribs are
  ready to be taken out of the smoker.
- Once the ribs are done, wrap them tightly with aluminum foil, and
  allow to rest 10 to 15 minutes. This will allow the juices to reabsorb
  into the meat and make the ribs moist.
** Beef and Ale Pie
*** Ingredients
**** Meat
- small handful dried porcini mushrooms (about 10g) - not essential but
  very tasty
- 2 tbsp vegetable oil
- 1kg braising steak (buy this as a whole piece and cut it yourself into
  large chunks)
- 2 large onions
- Onion roughly chopped
- 4 large carrots chopped into large chunks
- 2 tsp golden caster sugar
- 4 tbsp plain flour
- 300ml dark ale
- 2 beef stock cubes mixed with 400ml boiling water
- small bunch each thyme bay leaf and parsley, tied together
- 200g smoked bacon lardons, or chopped rashers
- 200g chestnut mushroom, halved
**** For the pastry
- 650g plain flour, plus extra for dusting
- 250g lard or cold butter (or half of each), diced, plus extra for
  greasing
- 1 egg yolk, beaten, to glaze

*** Method
- Start by braising the beef. If you're using the porcini, cover them in
  boiling water for 20 mins, then squeeze out but keep the soaking
  water. Heat oven to 160C/140C fan/gas 3. Heat half the oil in a large
  casserole dish, brown the meat really well in batches, then set aside.
- Add the onions and carrots to the pan, adding a drizzle more oil, then
  cook on a low heat for 5 mins until coloured. Add the soaked
  mushrooms, sizzle for 1 min more, then scatter over the sugar and
  flour, stirring until the flour turns brown. Tip the meat and any
  juices back into the pan and give it all a good stir. Pour over the
  ale, stock and porcini soaking liquid, discarding the last few drops.
  Season stew, tuck in the herbs and bring everything to a simmer. Cover
  with a lid and place in the oven for about 2 hrs, until the meat is
  really tender.
- While the stew is cooking, heat a drop more oil in a frying pan and
  sizzle the bacon for 3 mins until crisp. Turn up the heat, add the
  mushrooms and cook for 4 mins until golden. Remove from the heat and,
  when the stew is cooked, stir them through.
- Leave everything to cool completely -- better still, make this up to 2
  days in advance and keep it in the fridge as the pie will be better if
  the filling is fridge-cold when added. Can also be frozen for up to 3
  months and defrosted when needed.
- Make the pastry up to 2 days before you want to assemble the pie.
  Crumble the flour and lard, or butter, together with a generous pinch
  of sea salt until completely combined, then add up to 200ml ice-cold
  water to make a soft dough. This can be done in a food processor if
  you want.
- Knead the pastry, then wrap in cling film and leave to rest in the
  fridge for at least 1 hr. The pastry can be made up to 2 days ahead
  and kept in the fridge or frozen for up to a month.
- When you want to make the pie, heat oven to 220C/200C fan/gas 7 and
  place a flat baking tray in the oven. Heavily grease a 24-28cm pie
  dish and dust well with flour. Cut a third off the pastry and set
  aside. Roll out the pastry to a thick-ish round that will easily line
  the pie dish with an overhang, then line the tin.
- Add the beef to the dish using a slotted spoon so some gravy is left
  in the container, as you don't want too much sauce in the pie. You
  want the filling to be slightly higher than the rim of the dish. If
  you have a bit too much, set it aside.
- Roll out the remaining pastry to a thick round big enough to cover the
  dish. Brush the edges of the pastry in the dish with egg yolk, then
  cover with the pastry lid. Trim the edges, crimp the pastry, then
  re-roll your trimmings to make a decoration, if you like -- I always
  decorate my pies with pastry leaves. Brush the top heavily with egg.
  Make a few little slits in the centre of the pie, place on the hot
  baking tray.
- Bake for 40 mins until golden. Leave the pie to rest for 10 mins while
  you heat up the gravy left in the container. Serve the pie at the
  table with a jug of gravy and a big pile of something green and leafy.



