output/pages/recipes/recipes.html
<div id="outline-container-org306fa41" class="outline-3">
<h3 id="org306fa41"><span class="section-number-3">18.2</span> Method</h3>
<div class="outline-text-3" id="text-18-2">
<ul class="org-ul">
<li>Stir salt, white sugar, 2 tablespoons brown sugar, black pepper, white
pepper, onion powder, garlic powder, chili powder, paprika, and cumin
together in a small bowl to make the dry rub. Rub the spice mixture
into the baby back ribs on all sides. Wrap the ribs well with plastic
wrap, and refrigerate for at least 30 minutes prior to cooking.</li>
<li>Unwrap baby back ribs and place onto the wire racks of the smoker in a
single layer.</li>
<li>Place the racks into a smoker, fill the smoker pan with apple, grape,
pear, or cherry chips, and bring the smoker to 270 degrees F (130
degrees C). Smoke for 1 hour.</li>
<li>Stir together the apple juice, 1/4 cup brown sugar, and the barbeque
sauce. Brush the ribs with the sauce every 30 to 45 minutes after the
first hour. Cook the ribs in the smoker until the meat is no longer
pink and begins to "shrink" back from the bones, 3 to 4 hours. Brush
the sauce onto the ribs one last time 30 minutes before the ribs are
ready to be taken out of the smoker.</li>
<li>Once the ribs are done, wrap them tightly with aluminum foil, and
allow to rest 10 to 15 minutes. This will allow the juices to reabsorb
into the meat and make the ribs moist.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8d2ad0e" class="outline-2">
<h2 id="org8d2ad0e"><span class="section-number-2">19</span> Beef and Ale Pie</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-orgf8aae03" class="outline-3">
<h3 id="orgf8aae03"><span class="section-number-3">19.1</span> Ingredients</h3>
<div class="outline-text-3" id="text-19-1">
</div>
<div id="outline-container-org009fa91" class="outline-4">
<h4 id="org009fa91"><span class="section-number-4">19.1.1</span> Meat</h4>
<div class="outline-text-4" id="text-19-1-1">
<ul class="org-ul">
<li>small handful dried porcini mushrooms (about 10g) - not essential but
very tasty</li>
<li>2 tbsp vegetable oil</li>
<li>1kg braising steak (buy this as a whole piece and cut it yourself into
large chunks)</li>
<li>2 large onions</li>
<li>Onion roughly chopped</li>
<li>4 large carrots chopped into large chunks</li>
<li>2 tsp golden caster sugar</li>
<li>4 tbsp plain flour</li>
<li>300ml dark ale</li>
<li>2 beef stock cubes mixed with 400ml boiling water</li>
<li>small bunch each thyme bay leaf and parsley, tied together</li>
<li>200g smoked bacon lardons, or chopped rashers</li>
<li>200g chestnut mushroom, halved</li>
</ul>
</div>
</div>
<div id="outline-container-orge6f22bc" class="outline-4">
<h4 id="orge6f22bc"><span class="section-number-4">19.1.2</span> For the pastry</h4>
<div class="outline-text-4" id="text-19-1-2">
<ul class="org-ul">
<li>650g plain flour, plus extra for dusting</li>
<li>250g lard or cold butter (or half of each), diced, plus extra for
greasing</li>
<li>1 egg yolk, beaten, to glaze</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9bfc0cd" class="outline-3">
<h3 id="org9bfc0cd"><span class="section-number-3">19.2</span> Method</h3>
<div class="outline-text-3" id="text-19-2">
<ul class="org-ul">
<li>Start by braising the beef. If you're using the porcini, cover them in
boiling water for 20 mins, then squeeze out but keep the soaking
water. Heat oven to 160C/140C fan/gas 3. Heat half the oil in a large
casserole dish, brown the meat really well in batches, then set aside.</li>
<li>Add the onions and carrots to the pan, adding a drizzle more oil, then
cook on a low heat for 5 mins until coloured. Add the soaked
mushrooms, sizzle for 1 min more, then scatter over the sugar and
flour, stirring until the flour turns brown. Tip the meat and any
juices back into the pan and give it all a good stir. Pour over the
ale, stock and porcini soaking liquid, discarding the last few drops.
Season stew, tuck in the herbs and bring everything to a simmer. Cover
with a lid and place in the oven for about 2 hrs, until the meat is
really tender.</li>
<li>While the stew is cooking, heat a drop more oil in a frying pan and
sizzle the bacon for 3 mins until crisp. Turn up the heat, add the
mushrooms and cook for 4 mins until golden. Remove from the heat and,
when the stew is cooked, stir them through.</li>
<li>Leave everything to cool completely &#x2013; better still, make this up to 2
days in advance and keep it in the fridge as the pie will be better if
the filling is fridge-cold when added. Can also be frozen for up to 3
months and defrosted when needed.</li>
<li>Make the pastry up to 2 days before you want to assemble the pie.
Crumble the flour and lard, or butter, together with a generous pinch
of sea salt until completely combined, then add up to 200ml ice-cold
water to make a soft dough. This can be done in a food processor if
you want.</li>
<li>Knead the pastry, then wrap in cling film and leave to rest in the
fridge for at least 1 hr. The pastry can be made up to 2 days ahead
and kept in the fridge or frozen for up to a month.</li>
<li>When you want to make the pie, heat oven to 220C/200C fan/gas 7 and
place a flat baking tray in the oven. Heavily grease a 24-28cm pie
dish and dust well with flour. Cut a third off the pastry and set
aside. Roll out the pastry to a thick-ish round that will easily line
the pie dish with an overhang, then line the tin.</li>
<li>Add the beef to the dish using a slotted spoon so some gravy is left
in the container, as you don't want too much sauce in the pie. You
want the filling to be slightly higher than the rim of the dish. If
you have a bit too much, set it aside.</li>
<li>Roll out the remaining pastry to a thick round big enough to cover the
dish. Brush the edges of the pastry in the dish with egg yolk, then
cover with the pastry lid. Trim the edges, crimp the pastry, then
re-roll your trimmings to make a decoration, if you like &#x2013; I always
decorate my pies with pastry leaves. Brush the top heavily with egg.
Make a few little slits in the centre of the pie, place on the hot
baking tray.</li>
<li>Bake for 40 mins until golden. Leave the pie to rest for 10 mins while
you heat up the gravy left in the container. Serve the pie at the
table with a jug of gravy and a big pile of something green and leafy.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marc Scott</p>
<p class="date">Created: 2019-10-08 Tue 14:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
